import { Icon } from "@iconify/react";

export default function Footer() {
  return (
    <footer className="bg-white dark:bg-slate-900">
      <div className="mx-auto max-w-7xl overflow-hidden py-12 px-4 sm:px-6 lg:px-8">
        <nav
          className="-mx-5 -my-2 flex flex-wrap justify-center items-center"
          aria-label="Footer"
        >
          <a
            className="px-2 py-2"
            href="https://www.sendnodes.net"
            target="_blank"
          >
            <svg
              width="235"
              height="35"
              viewBox="0 0 235 35"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
              className="h-12 text-black dark:text-white"
            >
              <path
                d="M0 33.6512V32.7669H10.7982C13.6218 32.7669 15.0337 31.3861 15.0337 28.6245C15.0337 25.8318 13.9166 24.2493 11.6825 23.877L5.81798 22.8996C1.93933 22.248 0 20.2311 0 16.8489C0 12.722 2.23411 10.6585 6.70232 10.6585H14.7544L16.0576 11.6359V12.5203H6.37651C3.52182 12.5203 2.09447 13.9011 2.09447 16.6627C2.09447 19.0519 3.27359 20.4483 5.63181 20.8516L11.4963 21.8291C15.2819 22.4496 17.1747 24.6372 17.1747 28.3917C17.1747 32.5497 14.9251 34.6286 10.4258 34.6286H1.30323L0 33.6512Z"
                className="fill-neutral-500 dark:fill-white"
              />
              <path
                d="M23.6963 27.9728V17.3143C23.6963 12.8771 25.9149 10.6585 30.3521 10.6585H36.4028C40.8089 10.6585 43.012 12.8771 43.012 17.3143V23.5046H25.7908V28.4383C25.7908 31.324 27.2336 32.7669 30.1193 32.7669H42.0811V33.6512L40.7779 34.6286H30.3521C25.9149 34.6286 23.6963 32.41 23.6963 27.9728ZM25.7908 21.6429H40.9175V16.8489C40.9175 13.9631 39.4747 12.5203 36.5889 12.5203H30.1193C27.2336 12.5203 25.7908 13.9631 25.7908 16.8489V21.6429Z"
                className="fill-neutral-500 dark:fill-white"
              />
              <path
                d="M50.5677 34.6286V10.6585H63.2742C67.6804 10.6585 69.8834 12.8771 69.8834 17.3143V34.6286H67.789V16.8489C67.789 13.9631 66.3461 12.5203 63.4604 12.5203H52.6622V34.6286H50.5677Z"
                className="fill-neutral-500 dark:fill-white"
              />
              <path
                d="M77.2399 27.9728V17.3143C77.2399 12.8771 79.4585 10.6585 83.8957 10.6585H94.4611V0.186157H96.5556V34.6286H83.8957C79.4585 34.6286 77.2399 32.41 77.2399 27.9728ZM79.3344 28.4383C79.3344 31.324 80.7773 32.7669 83.663 32.7669H94.4611V12.5203H83.663C80.7773 12.5203 79.3344 13.9631 79.3344 16.8489V28.4383Z"
                className="fill-neutral-500 dark:fill-white"
              />
              <path
                d="M217.825 33.6512V32.7669H228.623C231.447 32.7669 232.859 31.3861 232.859 28.6245C232.859 25.8319 231.742 24.2494 229.508 23.877L223.643 22.8996C219.765 22.248 217.825 20.2311 217.825 16.8489C217.825 12.722 220.059 10.6586 224.528 10.6586H232.58L233.883 11.636V12.5203H224.202C221.347 12.5203 219.92 13.9011 219.92 16.6627C219.92 19.052 221.099 20.4483 223.457 20.8517L229.322 21.8291C233.107 22.4497 235 24.6372 235 28.3918C235 32.5497 232.75 34.6287 228.251 34.6287H219.129L217.825 33.6512Z"
                className="fill-current"
              />
              <path
                d="M106.772 34.6287V10.6586H119.478C123.884 10.6586 126.087 12.8772 126.087 17.3143V34.6287H123.993V16.8489C123.993 13.9632 122.55 12.5203 119.664 12.5203H108.866V34.6287H106.772Z"
                className="fill-current"
              />
              <path
                d="M133.444 27.9729V17.3143C133.444 12.8772 135.662 10.6586 140.1 10.6586H146.616C151.022 10.6586 153.225 12.8772 153.225 17.3143V27.9729C153.225 32.4101 151.022 34.6287 146.616 34.6287H140.1C135.662 34.6287 133.444 32.4101 133.444 27.9729ZM135.538 28.4383C135.538 31.324 136.981 32.7669 139.867 32.7669H146.802C149.688 32.7669 151.13 31.324 151.13 28.4383V16.8489C151.13 13.9632 149.688 12.5203 146.802 12.5203H139.867C136.981 12.5203 135.538 13.9632 135.538 16.8489V28.4383Z"
                className="fill-current"
              />
              <ellipse
                cx="170.211"
                cy="23.0858"
                rx="9.68112"
                ry="3.72351"
                className="fill-[#17FFFF]"
              />
              <ellipse
                cx="197.393"
                cy="14.5217"
                rx="9.68112"
                ry="3.72351"
                className="fill-[#1E91D6]"
              />
              <path
                d="M179.862 1.14441e-05V18.0858C179.294 17.609 178.583 17.1873 177.762 16.8389V1.14441e-05H179.862Z"
                className="fill-current"
              />
              <path
                fillRule="evenodd"
                clipRule="evenodd"
                d="M206.769 21.9687C205.694 23.5747 201.904 24.7613 197.393 24.7613C192.882 24.7613 189.091 23.5747 188.016 21.9687C187.817 22.2662 187.711 22.5782 187.711 22.8996C187.711 24.956 192.046 26.6231 197.393 26.6231C202.739 26.6231 207.074 24.956 207.074 22.8996C207.074 22.5782 206.968 22.2662 206.769 21.9687Z"
                className="fill-current"
              />
              <path
                d="M188.016 30.5328C189.091 32.0746 192.882 33.1393 197.393 33.1393C201.904 33.1393 205.694 32.0746 206.769 30.5328C206.968 30.8185 207.074 31.1179 207.074 31.4265C207.074 33.4007 202.739 35.001 197.393 35.001C192.046 35.001 187.711 33.4007 187.711 31.4265C187.711 31.1179 187.817 30.8185 188.016 30.5328Z"
                className="fill-current"
              />
              <path
                d="M160.835 30.5328C161.909 32.0746 165.7 33.1393 170.211 33.1393C174.722 33.1393 178.512 32.0746 179.587 30.5328C179.786 30.8185 179.892 31.1179 179.892 31.4265C179.892 33.4007 175.558 35.001 170.211 35.001C164.864 35.001 160.53 33.4007 160.53 31.4265C160.53 31.1179 160.636 30.8185 160.835 30.5328Z"
                className="fill-current"
              />
            </svg>
            <span className="sr-only">SendNodes, Inc.</span>
          </a>
          <a
            href={process.env.NEXT_PUBLIC_TWITTER_URL!}
            className="btn btn-circle btn-ghost btn-active px-2 py-2"
            target={"_blank"}
          >
            <span className="sr-only">Twitter SendNodes</span>
            <Icon icon="mdi:twitter" width={32} height={32} />
          </a>
          <a
            href={process.env.NEXT_PUBLIC_DISCORD_URL!}
            className="btn btn-circle btn-ghost btn-active px-2 py-2"
            target={"_blank"}
          >
            <span className="sr-only">Discord SendNodes</span>
            <Icon icon="akar-icons:discord-fill" width={32} height={32} />
          </a>
          <a
            href={process.env.NEXT_PUBLIC_TELEGRAM_URL!}
            className="btn btn-circle btn-ghost btn-active px-2 py-2"
            target={"_blank"}
          >
            <span className="sr-only">Telegram SendWallet by SendNodes</span>
            <Icon icon="bxl:telegram" width={32} height={32} />
          </a>
        </nav>

        <p className="mt-8 text-center text-base text-gray-400">
          <span className="text-4xl">👷‍♀️</span> Built By &copy;{" "}
          {new Date().getFullYear()} SendNodes, Inc. All rights reserved.
        </p>
      </div>
    </footer>
  );
}
